alimudena/INTAN-RHS2116/port/MSP430FG479/INTAN_config.c
    return true;
}

//Function to check if the INTAN is working at all
void check_intan_SPI_array(INTAN_config_struct* INTAN_config){
    volatile uint16_t reg_config_num = INTAN_config->max_size;

    //1.  SPI ficticio tras encender para asegurar que el controlador esta en el estado correcto
    INTAN_config->array1[reg_config_num] = READ_ACTION;
    INTAN_config->array2[reg_config_num] = REGISTER_VALUE_TEST;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;
    INTAN_config->expected_RX[reg_config_num] = CHIP_ID;
    INTAN_config->expected_RX_bool[reg_config_num] = 1;
    INTAN_config->instruction[reg_config_num] = 'K';
    reg_config_num += 1;

    //1.  SPI ficticio tras encender para asegurar que el controlador esta en el estado correcto
    INTAN_config->array1[reg_config_num] = READ_ACTION;
    INTAN_config->array2[reg_config_num] = REGISTER_VALUE_TEST;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;
    INTAN_config->expected_RX[reg_config_num] = CHIP_ID;
    INTAN_config->expected_RX_bool[reg_config_num] = 1;
    INTAN_config->instruction[reg_config_num] = 'K';
    reg_config_num += 1;

    //1.  SPI ficticio tras encender para asegurar que el controlador esta en el estado correcto
    INTAN_config->array1[reg_config_num] = READ_ACTION;
    INTAN_config->array2[reg_config_num] = REGISTER_VALUE_TEST;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;
    INTAN_config->expected_RX[reg_config_num] = CHIP_ID;
    INTAN_config->expected_RX_bool[reg_config_num] = 1;
    INTAN_config->instruction[reg_config_num] = 'K';
    reg_config_num += 1;
 
    INTAN_config->max_size = reg_config_num;
}


void clear_command(INTAN_config_struct* INTAN_config){
    volatile uint16_t reg_config_num = INTAN_config->max_size;
    // uint8_t obtained_RX_i = INTAN_config->obtained_RX_i;
    // Comando de limpieza recomendado en la pg 33 para inicializar el ADC para su operación normal
    INTAN_config->array1[reg_config_num] = CLEAR_ACTION;
    INTAN_config->array2[reg_config_num] = ZEROS_8;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;


    if (INTAN_config->C2_enabled == false){
        INTAN_config->expected_RX[reg_config_num] = ZEROS_32;
    } else{
        INTAN_config->expected_RX[reg_config_num] = RETURN_CLEAR_2C;
    }
    INTAN_config->expected_RX_bool[reg_config_num] = 0;
    INTAN_config->instruction[reg_config_num] = 'L';


    reg_config_num += 1;
 
    INTAN_config->max_size = reg_config_num;

}

void write_command(INTAN_config_struct* INTAN_config, uint8_t R, uint16_t D){
    volatile uint16_t reg_config_num = INTAN_config->max_size;
    // Flag U on M off
    if ((INTAN_config->U_flag == true)&&(INTAN_config->M_flag == false)){
        INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;

    // Flag U off M on
    } else if ((INTAN_config->U_flag == false)&&(INTAN_config->M_flag == true)) {
        INTAN_config->array1[reg_config_num] = WRITE_ACTION_M;
    
    // Flag U on M on
    }else if ((INTAN_config->U_flag == true)&&(INTAN_config->M_flag == true)) {
        INTAN_config->array1[reg_config_num] = WRITE_ACTION_U_M;
    
    // Flag U off M off
    }else{
        INTAN_config->array1[reg_config_num] = WRITE_ACTION;
    }

    INTAN_config->array2[reg_config_num] = R;
    uint8_t high_byte;
    uint8_t low_byte;

    split_uint16(D, &high_byte, &low_byte);
    INTAN_config->array3[reg_config_num] = high_byte;
    INTAN_config->array4[reg_config_num] = low_byte;
    uint32_t returned; 
    returned = unify_16bits(0b1111111111111111, D);
    INTAN_config->expected_RX[reg_config_num] = returned;
    INTAN_config->expected_RX_bool[reg_config_num] = 1;
    INTAN_config->instruction[reg_config_num] = 'W';

    reg_config_num += 1;

    INTAN_config->max_size = reg_config_num;

}

void read_command(INTAN_config_struct* INTAN_config, uint8_t R){
    volatile uint16_t reg_config_num = INTAN_config->max_size;
    // Flag U on M off
    if ((INTAN_config->U_flag == true)&&(INTAN_config->M_flag == false)){
        INTAN_config->array1[reg_config_num] = READ_ACTION_U;

    // Flag U off M on
    } else if ((INTAN_config->U_flag == false)&&(INTAN_config->M_flag == true)) {
        INTAN_config->array1[reg_config_num] = READ_ACTION_M;
    
    // Flag U on M on
    }else if ((INTAN_config->U_flag == true)&&(INTAN_config->M_flag == true)) {
        INTAN_config->array1[reg_config_num] = READ_ACTION_U_M;
    
    // Flag U off M off
    }else{
        INTAN_config->array1[reg_config_num] = READ_ACTION;
    }

    INTAN_config->array2[reg_config_num] = R;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;

    INTAN_config->expected_RX[reg_config_num] = ZEROS_32;
    INTAN_config->expected_RX_bool[reg_config_num] = 0;
    INTAN_config->instruction[reg_config_num] = 'R';

    reg_config_num += 1;

    INTAN_config->max_size = reg_config_num;
}



void fc_high(INTAN_config_struct* INTAN_config, char H_k, float_t freq){
    uint8_t RH1_sel1;
    uint8_t RH1_sel2;
    uint8_t RH2_sel1;
    uint8_t RH2_sel2;

    uint16_t RH1;
    uint16_t RH2;

    switch (H_k) {
        case 'k':
             if (freq == 20.0f){
                    RH1_sel1 = RH1_SEL1_20K;
                    RH1_sel2 = RH1_SEL2_20K;
                    RH2_sel1 = RH2_SEL1_20K;
                    RH2_sel2 = RH2_SEL2_20K;
                    }
              else if (freq == 15.0f){
                    RH1_sel1 = RH1_SEL1_15K;
                    RH1_sel2 = RH1_SEL2_15K;
                    RH2_sel1 = RH2_SEL1_15K;
                    RH2_sel2 = RH2_SEL2_15K;
                    }
              else if (freq == 10.0f){
                    RH1_sel1 = RH1_SEL1_10K;
                    RH1_sel2 = RH1_SEL2_10K;
                    RH2_sel1 = RH2_SEL1_10K;
                    RH2_sel2 = RH2_SEL2_10K;
                    }
              else if (freq == 7.5f){
                    RH1_sel1 = RH1_SEL1_7_5K;
                    RH1_sel2 = RH1_SEL2_7_5K;
                    RH2_sel1 = RH2_SEL1_7_5K;
                    RH2_sel2 = RH2_SEL2_7_5K;
                    }
              else if (freq == 5.0f){
                    RH1_sel1 = RH1_SEL1_5K;
                    RH1_sel2 = RH1_SEL2_5K;
                    RH2_sel1 = RH2_SEL1_5K;
                    RH2_sel2 = RH2_SEL2_5K;
                    }
              else if (freq == 3.0f){
                    RH1_sel1 = RH1_SEL1_3K;
                    RH1_sel2 = RH1_SEL2_3K;
                    RH2_sel1 = RH2_SEL1_3K;
                    RH2_sel2 = RH2_SEL2_3K;
                    }
              else if (freq == 2.5f){
                    RH1_sel1 = RH1_SEL1_2_5K;
                    RH1_sel2 = RH1_SEL2_2_5K;
                    RH2_sel1 = RH2_SEL1_2_5K;
                    RH2_sel2 = RH2_SEL2_2_5K;
                    }
              else if (freq == 2.0f){
                    RH1_sel1 = RH1_SEL1_2K;
                    RH1_sel2 = RH1_SEL2_2K;
                    RH2_sel1 = RH2_SEL1_2K;
                    RH2_sel2 = RH2_SEL2_2K;
                    }
              else if (freq == 1.5f){
                    RH1_sel1 = RH1_SEL1_1_5K;
                    RH1_sel2 = RH1_SEL2_1_5K;
                    RH2_sel1 = RH2_SEL1_1_5K;
                    RH2_sel2 = RH2_SEL2_1_5K;
                    }
              else if (freq == 1.0f){
                    RH1_sel1 = RH1_SEL1_1K;
                    RH1_sel2 = RH1_SEL2_1K;
                    RH2_sel1 = RH2_SEL1_1K;
                    RH2_sel2 = RH2_SEL2_1K;
                }
                
