alimudena/INTAN-RHS2116/port/MSP430FG479/INTAN_config.c
               else{     
                    perror("Error: high cutoff frequency Kilo.");
                        
               }
            break;

        case 'H':
                if (freq == 750){
                    RH1_sel1 = RH1_SEL1_750H;
                    RH1_sel2 = RH1_SEL2_750H;
                    RH2_sel1 = RH2_SEL1_750H;
                    RH2_sel2 = RH2_SEL2_750H;
                    }
                else if (freq == 500){
                    RH1_sel1 = RH1_SEL1_500H;
                    RH1_sel2 = RH1_SEL2_500H;
                    RH2_sel1 = RH2_SEL1_500H;
                    RH2_sel2 = RH2_SEL2_500H;
                    }
                else if (freq == 300){
                    RH1_sel1 = RH1_SEL1_300H;
                    RH1_sel2 = RH1_SEL2_300H;
                    RH2_sel1 = RH2_SEL1_300H;
                    RH2_sel2 = RH2_SEL2_300H;
                    }
                else if (freq == 250){
                    RH1_sel1 = RH1_SEL1_250H;
                    RH1_sel2 = RH1_SEL2_250H;
                    RH2_sel1 = RH2_SEL1_250H;
                    RH2_sel2 = RH2_SEL2_250H;
                    }
                else if (freq == 200){
                    RH1_sel1 = RH1_SEL1_200H;
                    RH1_sel2 = RH1_SEL2_200H;
                    RH2_sel1 = RH2_SEL1_200H;
                    RH2_sel2 = RH2_SEL2_200H;
                    }
                else if (freq == 150){
                    RH1_sel1 = RH1_SEL1_150H;
                    RH1_sel2 = RH1_SEL2_150H;
                    RH2_sel1 = RH2_SEL1_150H;
                    RH2_sel2 = RH2_SEL2_150H;
                    }
                else if (freq == 100){
                    RH1_sel1 = RH1_SEL1_100H;
                    RH1_sel2 = RH1_SEL2_100H;
                    RH2_sel1 = RH2_SEL1_100H;
                    RH2_sel2 = RH2_SEL2_100H;}
                else{
                    perror("Error: high cutoff frequency H.");
                    }    
            break;
        default:
            perror("Error: high cutoff frequency units.");
            break;    
    }
    RH1 = ((uint16_t)RH1_sel2 << 6) | RH1_sel1;
    RH2 = ((uint16_t)RH2_sel2 << 6) | RH2_sel1;

    // RH1 = unify_8bits(RH1_sel2, RH1_sel1);   
    // RH2 = unify_8bits(RH2_sel2, RH2_sel1);

    // Calls write command with the corresponding registers and frequency values
    write_command(INTAN_config, (uint8_t)ADC_HIGH_FREQ_4, RH1);
    write_command(INTAN_config, (uint8_t)ADC_HIGH_FREQ_5, RH2);

}

void fc_low_A(INTAN_config_struct* INTAN_config, float_t freq){
    uint8_t RL_SEL1;
    uint8_t RL_SEL2;
    uint8_t RL_SEL3;

    uint16_t RL;
    if (freq == 1000.0f){
        RL_SEL1 = RL_SEL1_1k;
        RL_SEL2 = RL_SEL2_1k;
        RL_SEL3 = RL_SEL3_1k;

    }else if(freq == 500.0f){
        RL_SEL1 = RL_SEL1_500H;
        RL_SEL2 = RL_SEL2_500H;
        RL_SEL3 = RL_SEL3_500H;

    }else if(freq == 300.0f){
        RL_SEL1 = RL_SEL1_300H;
        RL_SEL2 = RL_SEL2_300H;
        RL_SEL3 = RL_SEL3_300H;
        
    }else if(freq == 250.0f){
        RL_SEL1 = RL_SEL1_250H;
        RL_SEL2 = RL_SEL2_250H;
        RL_SEL3 = RL_SEL3_250H;
        
    }else if(freq == 200.0f){
        RL_SEL1 = RL_SEL1_200H;
        RL_SEL2 = RL_SEL2_200H;
        RL_SEL3 = RL_SEL3_200H;
        
    }else if(freq == 150.0f){
        RL_SEL1 = RL_SEL1_150H;
        RL_SEL2 = RL_SEL2_150H;
        RL_SEL3 = RL_SEL3_150H;
        
    }else if(freq == 100.0f){
        RL_SEL1 = RL_SEL1_100H;
        RL_SEL2 = RL_SEL2_100H;
        RL_SEL3 = RL_SEL3_100H;
        
    }else if(freq == 75.0f){
        RL_SEL1 = RL_SEL1_75H;
        RL_SEL2 = RL_SEL2_75H;
        RL_SEL3 = RL_SEL3_75H;
        
    }else if(freq == 50.0f){
        RL_SEL1 = RL_SEL1_50H;
        RL_SEL2 = RL_SEL2_50H;
        RL_SEL3 = RL_SEL3_50H;
        
    }else if(freq == 30.0f){
        RL_SEL1 = RL_SEL1_30H;
        RL_SEL2 = RL_SEL2_30H;
        RL_SEL3 = RL_SEL3_30H;
        
    }else if(freq == 25.0f){
        RL_SEL1 = RL_SEL1_25H;
        RL_SEL2 = RL_SEL2_25H;
        RL_SEL3 = RL_SEL3_25H;
        
    }else if(freq == 20.0f){
        RL_SEL1 = RL_SEL1_20H;
        RL_SEL2 = RL_SEL2_20H;
        RL_SEL3 = RL_SEL3_20H;
        
    }else if(freq == 15.0f){
        RL_SEL1 = RL_SEL1_15H;
        RL_SEL2 = RL_SEL2_15H;
        RL_SEL3 = RL_SEL3_15H;
        
    }else if(freq == 10.0f){
        RL_SEL1 = RL_SEL1_10H;
        RL_SEL2 = RL_SEL2_10H;
        RL_SEL3 = RL_SEL3_10H;
        
    }else if(freq == 7.5f){
        RL_SEL1 = RL_SEL1_7_5H;
        RL_SEL2 = RL_SEL2_7_5H;
        RL_SEL3 = RL_SEL3_7_5H;
        
    }else if(freq == 5.0f){
        RL_SEL1 = RL_SEL1_5H;
        RL_SEL2 = RL_SEL2_5H;
        RL_SEL3 = RL_SEL3_5H;
        
    }else if(freq == 3.0f){
        RL_SEL1 = RL_SEL1_3H;
        RL_SEL2 = RL_SEL2_3H;
        RL_SEL3 = RL_SEL3_3H;
        
    }else if(freq == 2.5f){
        RL_SEL1 = RL_SEL1_2_5H;
        RL_SEL2 = RL_SEL2_2_5H;
        RL_SEL3 = RL_SEL3_2_5H;
        
    }else if(freq == 2.0f){
        RL_SEL1 = RL_SEL1_2H;
        RL_SEL2 = RL_SEL2_2H;
        RL_SEL3 = RL_SEL3_2H;
        
    }else if(freq == 1.5f){
        RL_SEL1 = RL_SEL1_1_5H;
        RL_SEL2 = RL_SEL2_1_5H;
        RL_SEL3 = RL_SEL3_1_5H;
        
    }else if(freq == 1.0f){
        RL_SEL1 = RL_SEL1_1H;
        RL_SEL2 = RL_SEL2_1H;
        RL_SEL3 = RL_SEL3_1H;
        
    }else if(freq == 0.75f){
        RL_SEL1 = RL_SEL1_0_75H;
        RL_SEL2 = RL_SEL2_0_75H;
        RL_SEL3 = RL_SEL3_0_75H;
        
    }else if(freq == 0.5f){
        RL_SEL1 = RL_SEL1_0_5H;
        RL_SEL2 = RL_SEL2_0_5H;
        RL_SEL3 = RL_SEL3_0_5H;
        
    }else if(freq == 0.3f){
        RL_SEL1 = RL_SEL1_0_3H;
        RL_SEL2 = RL_SEL2_0_3H;
        RL_SEL3 = RL_SEL3_0_3H;
        
    }else if(freq == 0.25f){
        RL_SEL1 = RL_SEL1_0_25H;
        RL_SEL2 = RL_SEL2_0_25H;
        RL_SEL3 = RL_SEL3_0_25H;
        
    }else if(freq == 0.1f){
        RL_SEL1 = RL_SEL1_0_1H;
        RL_SEL2 = RL_SEL2_0_1H;
        RL_SEL3 = RL_SEL3_0_1H;
        
    }else{
        perror("Error: high cutoff frequency Kilo.");
    }
    RL = ((uint16_t)RL_SEL3 << 13) |((uint16_t)RL_SEL2 << 7) | RL_SEL1;
    write_command(INTAN_config, (uint8_t)ADC_LOW_FREQ_A, RL);

