alimudena/INTAN-RHS2116/port/MSP430FG479/INTAN_config.c
    INTAN_config->array2[reg_config_num] = Channel;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;

    INTAN_config->expected_RX_bool[reg_config_num] = 0;
    INTAN_config->instruction[reg_config_num] = 'O';


    reg_config_num += 1;

    for (i = number_channels; i>0; i--){
        // No flags
        INTAN_config->array1[reg_config_num] = CONVERT_ACTION;
        
        // U flag
        if (INTAN_config->U_flag == true){
            saved_value = INTAN_config->array1[reg_config_num];
            INTAN_config->array1[reg_config_num] = saved_value | CONVERT_ACTION_U; 
        } 
        
        // M flag
        if (INTAN_config->M_flag == true){
            saved_value = INTAN_config->array1[reg_config_num];
            INTAN_config->array1[reg_config_num] = saved_value | CONVERT_ACTION_M; 
        } 
        
        // D flag 
        if (INTAN_config->D_flag == true){
            saved_value = INTAN_config->array1[reg_config_num];
            INTAN_config->array1[reg_config_num] = saved_value | CONVERT_ACTION_D; 
        } 

        // H flag
        if (INTAN_config->H_flag == true){
            saved_value = INTAN_config->array1[reg_config_num];
            INTAN_config->array1[reg_config_num] = saved_value | CONVERT_ACTION_H; 
        } 

        INTAN_config->array2[reg_config_num] = CONVERT_ACTION_N;
        INTAN_config->array3[reg_config_num] = ZEROS_8;
        INTAN_config->array4[reg_config_num] = ZEROS_8;

        INTAN_config->expected_RX_bool[reg_config_num] = 0;
        INTAN_config->instruction[reg_config_num] = 'O';


        reg_config_num += 1;
    }
    INTAN_config->max_size = reg_config_num;
}

uint16_t unify_8bits(uint8_t high, uint8_t low) {
    return ((uint16_t)high << 8) | low;
}


uint32_t unify_16bits(uint16_t high, uint16_t low) {
    return ((uint32_t)high << 16) | low;
}


// Step selection values as lookup tables
typedef struct {
    uint16_t current_nA;  // Current step in nA
    uint8_t sel1;         // 7 bits
    uint8_t sel2;         // 6 bits
    uint8_t sel3;         // 2 bits
} StepConfig;

static const StepConfig step_table[] = {
    // step_sel   sel1       sel2       sel3
    {  /*10nA*/ 10,      SEL1_10nA,         SEL2_10nA,         SEL3_10nA },  // SEL1_10nA, SEL2_10nA, SEL3_10nA
    {  /*20nA*/ 20,      SEL1_20nA,         SEL2_20nA,         SEL3_20nA },  
    {  /*50nA*/ 50,      SEL1_50nA,         SEL2_50nA,         SEL3_50nA },
    {  /*100nA*/ 100,   SEL1_100nA,        SEL2_100nA,         SEL3_100nA },
    {  /*200nA*/ 200,   SEL1_200nA,        SEL2_200nA,         SEL3_200nA },
    {  /*500nA*/ 500,   SEL1_500nA,        SEL2_500nA,         SEL3_500nA },
    {  /*1uA*/ 1000,      SEL1_1uA,          SEL2_1uA,         SEL3_1uA },
    {  /*2uA*/ 2000,      SEL1_2uA,          SEL2_2uA,         SEL3_2uA },
    {  /*5uA*/ 5000,      SEL1_5uA,          SEL2_5uA,         SEL3_5uA },
    { /*10uA*/ 10000,    SEL1_10uA,         SEL2_10uA,         SEL3_10uA }
};

// Step selection values as lookup tables
typedef struct {
    uint16_t current_nA;  // Current step in nA
    uint8_t PBIAS;         // 7 bits
    uint8_t NBIAS;         // 6 bits
} BiasVoltageConfig;

static const BiasVoltageConfig bias_voltage_table[] = {
    // BiasVoltage   PBIAS       NBIAS       
    {  /*10nA*/ 10,      PBIAS_10nA,         NBIAS_10nA},  // SEL1_10nA, SEL2_10nA, SEL3_10nA
    {  /*20nA*/ 20,      PBIAS_20nA,         NBIAS_20nA},  
    {  /*50nA*/ 50,      PBIAS_50nA,         NBIAS_50nA},
    {  /*100nA*/ 100,   PBIAS_100nA,        NBIAS_100nA},
    {  /*200nA*/ 200,   PBIAS_200nA,        NBIAS_200nA},
    {  /*500nA*/ 500,   PBIAS_500nA,        NBIAS_500nA},
    {  /*1uA*/ 1000,      PBIAS_1uA,          NBIAS_1uA},
    {  /*2uA*/ 2000,      PBIAS_2uA,          NBIAS_2uA},
    {  /*5uA*/ 5000,      PBIAS_5uA,          NBIAS_5uA},
    { /*10uA*/ 10000,    PBIAS_10uA,         NBIAS_10uA}
};

// Step selection values as lookup tables
typedef struct {
    uint16_t current_nA;  // Current step in nA
    uint8_t sel1;         // 7 bits
    uint8_t sel2;         // 6 bits
    uint8_t sel3;         // 2 bits
} chrg_recov_curr_lim_config;

static const chrg_recov_curr_lim_config chrg_recov_curr_lim_table[] = {
    // step_sel   sel1       sel2       sel3
    {  /*1nA*/ 1,        CL_SEL1_1nA,         CL_SEL2_1nA,         CL_SEL3_1nA },  // SEL1_10nA, SEL2_10nA, SEL3_10nA
    {  /*2nA*/ 2,        CL_SEL1_2nA,         CL_SEL2_2nA,         CL_SEL3_2nA },  
    {  /*5nA*/ 5,        CL_SEL1_5nA,         CL_SEL2_5nA,         CL_SEL3_5nA },
    {  /*10nA*/ 10,     CL_SEL1_10nA,        CL_SEL2_10nA,         CL_SEL3_10nA },
    {  /*20nA*/ 20,     CL_SEL1_20nA,        CL_SEL2_20nA,         CL_SEL3_20nA },
    {  /*50nA*/ 50,     CL_SEL1_50nA,        CL_SEL2_50nA,         CL_SEL3_50nA },
    {  /*100nA*/ 100,  CL_SEL1_100nA,       CL_SEL2_100nA,         CL_SEL3_100nA },
    {  /*200nA*/ 200,  CL_SEL1_200nA,       CL_SEL2_200nA,         CL_SEL3_200nA },
    {  /*500nA*/ 500,  CL_SEL1_500nA,       CL_SEL2_500nA,         CL_SEL3_500nA },
    {  /*1000nA*/ 1000,  CL_SEL1_1uA,         CL_SEL2_1uA,         CL_SEL3_1uA }
};

uint16_t step_sel_united(uint16_t step_sel) {
    unsigned int i;
    for (i = (sizeof(step_table) / sizeof(step_table[0])) - 1; i < sizeof(step_table) / sizeof(step_table[0]); --i) {
        if (step_table[i].current_nA == step_sel) {
            StepConfig cfg = step_table[i];
            uint16_t result = 0;
            result |= (cfg.sel3 & 0x03) << 13;
            result |= (cfg.sel2 & 0x3F) << 7;
            result |= (cfg.sel1 & 0x7F);
            return result;
        }
    }
    return 0; // Return 0 if step_sel is invalid
}


uint8_t vias_voltages_sel(uint16_t step_sel) {
    unsigned int i;
    for (i = (sizeof(bias_voltage_table) / sizeof(bias_voltage_table[0])) - 1; i < sizeof(bias_voltage_table) / sizeof(bias_voltage_table[0]); --i) {
        if (bias_voltage_table[i].current_nA == step_sel) {
            BiasVoltageConfig cfg = bias_voltage_table[i];
            uint8_t result = 0;
            result |= (cfg.PBIAS & 0x3F) << 4;
            result |= (cfg.NBIAS & 0x7F);
            return result;
        }
    }
    return 0; // Return 0 if step_sel is invalid
}


uint16_t chrg_recov_curr_lim_united(uint16_t curr_lim_sel) {
    unsigned int i;
    for (i = (sizeof(chrg_recov_curr_lim_table) / sizeof(chrg_recov_curr_lim_table[0])) - 1; i < sizeof(chrg_recov_curr_lim_table) / sizeof(chrg_recov_curr_lim_table[0]); --i) {
        if (chrg_recov_curr_lim_table[i].current_nA == curr_lim_sel) {
            chrg_recov_curr_lim_config cfg = chrg_recov_curr_lim_table[i];
            uint16_t result = 0;
            result |= (cfg.sel3 & 0x03) << 13;
            result |= (cfg.sel2 & 0x3F) << 7;
            result |= (cfg.sel1 & 0x7F);
            return result;
        }
    }
    return 0; // Return 0 if curr_lim_sel is invalid
}


/**
 * Splits a 16-bit value into two 8-bit values.
 *
 * @param input     The 16-bit input value.
 * @param high_byte Pointer to store the high (most significant) 8 bits.
 * @param low_byte  Pointer to store the low (least significant) 8 bits.
 */
void split_uint16(uint16_t input, uint8_t* high_byte, uint8_t* low_byte) {
    if (high_byte) {
        *high_byte = (input >> 8) & 0xFF;  // Get the upper 8 bits
    }
    if (low_byte) {
        *low_byte = input & 0xFF;          // Get the lower 8 bits
    }
}

uint8_t calculate_current_lim_chr_recov(float target_voltage){
    if ((target_voltage > 1.225)||((target_voltage < -1.225))){
        return 0;
    }
    uint8_t dac_value = (uint8_t)roundf((target_voltage / 0.00957f) + 128.0f);
    return dac_value;
}

uint8_t calculate_stim_current(INTAN_config_struct* INTAN_config, uint16_t I_target_nA){
    uint8_t magnitude = (uint8_t)(I_target_nA / INTAN_config->step_sel);
    return magnitude;
}


