alimudena/INTAN-RHS2116/port/MSP430FG479/INTAN_config.c
    //12. Establece las corrientes negativas de estimulacion en cero centrando los ajustes de corriente (64...)
    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH0_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;
    
    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH1_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH2_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH3_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH4_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH5_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH6_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH7_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH8_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH9_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH10_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH11_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH12_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH13_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH14_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH15_NEG_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    //13. Establece las corrientes positivas de estimulacion en cero centrando los ajustes de corriente (96...)
    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH0_POS_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;
    
    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH1_POS_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH2_POS_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH3_POS_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH4_POS_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH5_POS_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH6_POS_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH7_POS_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH8_POS_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH9_POS_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH10_POS_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH11_POS_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH12_POS_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH13_POS_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH14_POS_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;

    INTAN_config->array1[reg_config_num] = WRITE_ACTION_U;
    INTAN_config->array2[reg_config_num] = CH15_POS_CURR_MAG;
    INTAN_config->array3[reg_config_num] = 0x80;
    INTAN_config->array4[reg_config_num] = 0x00;
    reg_config_num++;
    
    
    //14. Habilitar la estimulacion de los estimuladores (32, 33)
    //REGISTER 32: Enable - disable stimulation
    INTAN_config->array1[reg_config_num] = WRITE_ACTION;
    INTAN_config->array2[reg_config_num] = STIM_ENABLE_A_reg;
    INTAN_config->array3[reg_config_num] = STIM_ENABLE_A_VALUE_H;
    INTAN_config->array4[reg_config_num] = STIM_ENABLE_A_VALUE_L;
    reg_config_num++;

    //REGISTER 33: Enable - disable stimulation
    INTAN_config->array1[reg_config_num] = WRITE_ACTION;
    INTAN_config->array2[reg_config_num] = STIM_ENABLE_B_reg;
    INTAN_config->array3[reg_config_num] = STIM_ENABLE_B_VALUE_H;
    INTAN_config->array4[reg_config_num] = STIM_ENABLE_B_VALUE_L;
    reg_config_num++;

    //15. Comando ficticio con flag M activado para limpiar el monitor de conformidad (255 - register value test)
    INTAN_config->array1[reg_config_num] = READ_ACTION_M;
    INTAN_config->array2[reg_config_num] = REGISTER_VALUE_TEST;
    INTAN_config->array3[reg_config_num] = ZEROS_8;
    INTAN_config->array4[reg_config_num] = ZEROS_8;
    reg_config_num++;

    INTAN_config->max_size = reg_config_num;

}


void update_packets(uint16_t pckt_count, uint8_t* val1, uint8_t* val2, uint8_t* val3, uint8_t* val4, INTAN_config_struct* INTAN_config) {
    
    // Retrieve values from each array at the given index
    *val1 = INTAN_config->array1[pckt_count];
    *val2 = INTAN_config->array2[pckt_count];
    *val3 = INTAN_config->array3[pckt_count];
    *val4 = INTAN_config->array4[pckt_count];
}

void wait_5_CYCLES(){
    __delay_cycles(CLK_5_CYCLES);
}

void wait_30_seconds(){
    __delay_cycles(CLK_30_S_CYCLES);
}

void wait_5_mins(){
    __delay_cycles(CLK_5_M_CYCLES);
}

void wait_1_second(){
    __delay_cycles(CLK_1_S_CYCLES);
}

void wait_3_seconds(){
    __delay_cycles(CLK_3_S_CYCLES);
}

void wait_5_seconds(){
    __delay_cycles(CLK_5_S_CYCLES);
}


